# ---------file for all text-constants-----------
WELCOME = "Добро пожаловать в бота"

START_REG_MES = "Введите ваше имя:"
AGE_REG_MES = "Введите ваш возраст"
BEST_RETIRE_TIME_MES = "Введите эталонное время засыпания в формате '22:43' или '00:00' и т.д."
BEST_WAKEUP_TIME_MES = "Введите эталонное время пробуждения в томже формате"
BEST_DURATION_TIME_MES = "Вы можете ложиться и вставать очень дисциплинированно, но если вы спите меньше 8 часов в день, то в среднем этого недостаточно, чтобы восстановиться. Установите эталонную продолжительность сна в виде целого значения. Рекомендуемое значение: 8"

WARNING_NAME_MES = "Имя должно состоять только из букв"
WARNING_AGE_MES = "Возраст должен состоять только из цифр и быть от 10 до 100"
WARNING_TIME_MES = "Время должно быть указано в формате часов и минут через двоеточие без пробелов. Примеры: 16:40, 18:35, 22:49 и тд"
WARNING_DURATION_TIME_MES = "Значение продолжительности сна должно быть от целмы значением от 6 до 12, иначе вы сильно недосыпаете или пересыпаете"

REG_COMPLETE_MES = "Регистрация успешно завершена. Вы всегда можете изменить указанные значения в меню 'Редактирование'."

BUTTON_GO_ASLEEP = "ПОЙТИ СПАТЬ"
BUTTON_EDIT = "РЕДАКТИРОВАНИЕ"
BUTTON_STATS = "СТАТИСТИКА"

INLINE_BUTTON_END_SLEEP = "Завершить сон"
END_SLEEP_CALLBACK = "END_SLEEP_CALLBACK"
INLINE_BUTTON_CANCEL_SLEEP = "Отменить сон"
CANCEL_SLEEP_CALLBACK = "CANCEL_SLEEP_CALLBACK"

RETIRE_MODE_ACTIVATED = "Время засыпания успешно внесено. После пробуждения выберите кнопку 'Завершить сон'. Если хотите отменить внесенное время засыпания нажимите 'Отменить сон'."